InformationRegisters/SM_СтатусСогласованияДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>SM_СтатусСогласованияДокумента</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументИсполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/SM_СтатусСогласованияДокумента/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(Документ,Статус,Причина,Период = '20241111000000',НомерИтерации = "",ДокументИсполнения = "",ПлатежноеПоручение = "",Исполнитель = "") Экспорт 
	
	Замещать = Ложь;
	
	МенеджерЗаписи = РегистрыСведений.SM_СтатусСогласованияДокумента.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период				= Период;
	МенеджерЗаписи.Документ				= Документ;
	МенеджерЗаписи.ДокументИсполнения	= ДокументИсполнения;
	МенеджерЗаписи.НомерИтерации		= НомерИтерации;
	МенеджерЗаписи.Статус				= Статус;
	МенеджерЗаписи.Причина				= Причина;	
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда  
		МенеджерЗаписи.Период				= Период;
		МенеджерЗаписи.Документ				= Документ;
		МенеджерЗаписи.ДокументИсполнения	= ДокументИсполнения;
		МенеджерЗаписи.НомерИтерации		= НомерИтерации;
		МенеджерЗаписи.Статус				= Статус;
		МенеджерЗаписи.Причина				= Причина;
		МенеджерЗаписи.Исполнитель			= Исполнитель;
		МенеджерЗаписи.Записать(Ложь);
	Иначе
		МенеджерЗаписи.ДокументИсполнения	= ДокументИсполнения;
		МенеджерЗаписи.НомерИтерации		= НомерИтерации;
		МенеджерЗаписи.Статус				= Статус;
		МенеджерЗаписи.Причина				= Причина; 
		МенеджерЗаписи.ПлатежноеПоручение	= ПлатежноеПоручение;
		//МенеджерЗаписи.Исполнитель			= Исполнитель;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
		
КонецПроцедуры 

Функция СогласованиеЗакрыто(Документ)Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.SM_СтатусСогласованияДокумента.СрезПоследних КАК SM_СтатусСогласованияДокументаСрезПоследних
		|ГДЕ
		|	SM_СтатусСогласованияДокументаСрезПоследних.Документ = &Документ
		|	И (ВЫРАЗИТЬ(SM_СтатусСогласованияДокументаСрезПоследних.Статус КАК СТРОКА(100))) = ""Закрыт""";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьСтатусыПоСогласованнымДокументам() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SM_СтатусСогласованияДокументаСрезПоследних.Документ КАК Документ
		|ИЗ
		|	РегистрСведений.SM_СтатусСогласованияДокумента.СрезПоследних КАК SM_СтатусСогласованияДокументаСрезПоследних
		|ГДЕ
		|	SM_СтатусСогласованияДокументаСрезПоследних.Статус = ""Открыт""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			ДокументСсылка = ВыборкаДетальныеЗаписи.Документ; 
			JSON = SM_ПроцедурыФункцииСогласованияСервер.СформироватьJSONУникальныйИдентификатор(ДокументСсылка.УникальныйИдентификатор());
			Статус = SM_ПроцедурыФункцииСогласованияСервер.ОтправитьЗапросВДокументооборот("GetStatus",JSON,Истина);
			Если Статус = "Положительно" ИЛИ Статус = "ПоложительноСЗамечаниями" Тогда
				СтрокаXML = SM_ПроцедурыФункцииСогласованияСервер.ОтправитьЗапросВДокументооборот("GetResults",JSON,Истина); 
				Таблица = SM_ПроцедурыФункцииСогласованияСервер.ПроизвестиЧтениеТаблицыИзXMLСервер(СтрокаXML);
				Исполнитель = "";
				Для Каждого Строка Из Таблица Цикл
					Сотрудник = SM_ПроцедурыФункцииСогласованияСервер.ПоискСотрудника(Строка.Исполнитель);
					ДобавитьЗапись(ДокументСсылка,Строка.Статус,Строка.Причина,Строка.Дата,Строка.НомерИтерации,Строка.ДокументИсполнения,,Сотрудник);
					Если Строка.Статус = "Согласовано" Тогда
						Исполнитель = Сотрудник;
					КонецЕсли;
				КонецЦикла;  
				ДобавитьЗапись(ДокументСсылка,"Закрыт","",ТекущаяДата(),,,,Исполнитель);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Функция СогласованиеПоДанномуДокументуЗапущено(Документ) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.SM_СтатусСогласованияДокумента.СрезПервых КАК SM_СтатусСогласованияДокументаСрезПервых
		|ГДЕ
		|	SM_СтатусСогласованияДокументаСрезПервых.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Функция СогласованиеПревано(Документ) Экспорт
	ТаблицаЗначенийРезультат = СрезПоследних(ТекущаяДата(),Новый Структура("Документ",Документ));
	Если ТаблицаЗначенийРезультат.Количество() <> 0 Тогда 
		ТекущийСтатус = ТаблицаЗначенийРезультат[0].Статус;
		Если ТекущийСтатус = "Прерван" Тогда 
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
